http://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'name':['alex','bill','charllie','danny','frank'],
                   'age':[28,21,22,16,30],
                   'sex':['male','male','female','male','female'],
                   'married':[0,1,1,0,1]})
df

   age  married      name     sex
0   28        0      alex    male
1   21        1      bill    male
2   22        1  charllie  female
3   16        0     danny    male
4   30        1     frank  female

In [ ]:
df.info()
df.describe()

### df.index  df.columns

### df.head()  df.tail()

### groupby()

In [5]:
group = df.groupby(['sex'])['age'].mean()
group

sex
female    26.000000
male      21.666667
Name: age, dtype: float64

In [38]:
group1 = df.groupby(['sex','married']).sum()
print(group1)

                age
sex    married
female 1         52
male   0         44
       1         21

In [14]:
sex_group = df.groupby(['sex','married'])['age'].sum()
print(sex_group)

sex     married
female  1          52
male    0          44
        1          21
Name: age, dtype: int64

## Indix

In [28]:
res1 = df.loc[df['age']>25]
print(res1)

#
print('---------------------------------')
res2 = df.loc[df['age']>25].age
print(res2)

#
print('---------------------------------')
res3 = df.loc[df['age']>25,'age']
print(res3)

   age  married   name     sex
0   28        0   alex    male
4   30        1  frank  female
---------------------------------
0    28
4    30
Name: age, dtype: int64
---------------------------------
0    28
4    30
Name: age, dtype: int64

In [ ]:
df2[df2['E'].isin(['two', 'four'])]

### drop

In [ ]:
df_copy = df.copy()
df_copy.drop(['age','sex'],axis=1,inplace=True)

## one-hot code

### get_dummies

In [6]:
df1 = df.copy()
df1 = pd.get_dummies(df1, columns=["sex",'name'],\
                          prefix=["Sex",'Name'], drop_first=True)
df1

   age  married  Sex_male  Name_bill  Name_charllie  Name_danny  Name_frank
0   28        0         1          0              0           0           0
1   21        1         1          1              0           0           0
2   22        1         0          0              1           0           0
3   16        0         1          0              0           1           0
4   30        1         0          0              0           0           1

In [7]:
res = df1.groupby(['Sex_male'])['age'].mean()
res

Sex_male
0    26.000000
1    21.666667
Name: age, dtype: float64

In [47]:
df2 = df.copy()
df2 = pd.get_dummies(df2, columns=["sex",'name'],\
                          prefix=["Sex",'Name'])
df2

,age,married,Sex_female,Sex_male,Name_alex,Name_bill,Name_charllie,Name_danny,Name_frank
0,28,0,0,1,1,0,0,0,0
1,21,1,0,1,0,1,0,0,0
2,22,1,1,0,0,0,1,0,0
3,16,0,0,1,0,0,0,1,0
4,30,1,1,0,0,0,0,0,1

### fillna

In [ ]:
## 使用sklearn

In [ ]:
import sklearn.preprocessing as preprocessing
tdf = pd.DataFrame({'age':np.arange(10),'height':[170]*10})
param = preprocessing.StandardScaler().fit(tdf['age'].values.reshape(-1, 1))
tdf['age_scaled'] = preprocessing.StandardScaler().fit_transform(tdf['age'].values.reshape(-1, 1),param)
tdf

## map

In [ ]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s.map({'cat': 'kitten', 'dog': 'puppy'})

## date处理

In [3]:
test_df = pd.DataFrame({'date':['2015-03-01','2015-04-05']})
test_df

         date
0  2015-03-01
1  2015-04-05

In [4]:
test_df['date1'] = test_df.date
test_df['date1'] = pd.to_datetime(test_df.date1)
test_df['date1']

0   2015-03-01
1   2015-04-05
Name: date1, dtype: datetime64[ns]

In [5]:
test_df['date1'] = test_df.date1.apply(lambda x:x.date())
test_df.date1

0    2015-03-01
1    2015-04-05
Name: date1, dtype: object

# Math

### transform

Series.transform(func, axis=0, *args, **kwargs)<br>

Call func on self producing a Series with transformed values and that has the same axis length as self.<br>
http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.transform.html?highlight=transform#pandas.Series.transform

In [31]:
df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
df.transform(lambda x: x + 1)

   A  B
0  1  2
1  2  3
2  3  4

In [29]:
s = pd.Series(range(3))

In [30]:
s.transform([np.sqrt, np.exp])

       sqrt       exp
0  0.000000  1.000000
1  1.000000  2.718282
2  1.414214  7.389056